GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/** @} */ // GPIO_LL_PinParams_Mode

/**
 * @brief GPIO Pin Configuration Type
 * @section GPIO_LL_PinParams_Config GPIO LL Pin Configuration 
 * @details
 * Type-safe abstraction for GPIO electrical configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: CNF field in CRL/CRH registers  
 * - **Current implementation**: `uint8_t` (0-3 range for 4 configuration types)
 * - **Future flexibility**: Can extend range if new configurations are added
 * - **Type safety**: Prevents accidental mixing with mode types
 * - **Context dependent**: Interpretation depends on mode (input vs output)
 * - **Hardware mapping**: Directly maps to 2-bit CNF field in configuration registers
 * 
 * @note Interpretation depends on current mode setting:
 *       - Input mode: Analog/Floating/Pull configurations
 *       - Output mode: Push-pull/Open-drain configurations
 * @{
 */
/** @brief GPIO Pin Configuration LL Data Type @typedef _gpio_config_t */
typedef uint8_t _gpio_config_t;
/** @brief GPIO Pull-Up/Pull-Down State @typedef _gpio_pin_pull_state_t */
typedef uint8_t _gpio_pin_pull_state_t;

/**
 * @brief Configuration setting when MODE = Input (0x00)
 * @section GPIO_LL_PinParams_CNF_Input_Macros 
 * @details Use this for LL Input Configuration 
 * @{
 */
/** @brief Input: Analog mode (CNF=0x00) @def _GPIO_CNF_INPUT_ANALOG */
#define _GPIO_CNF_INPUT_ANALOG							((_gpio_config_t) 0x00)
/** @brief Input: Floating input (CNF=0x01) @def _GPIO_CNF_INPUT_FLOATING */
#define _GPIO_CNF_INPUT_FLOATING						((_gpio_config_t) 0x01)
/** @brief Input: Pull-up/Pull-down (CNF=0x02) @def _GPIO_CNF_INPUT_PULL */
#define _GPIO_CNF_INPUT_PULL							((_gpio_config_t) 0x02)
/** @brief Input: Reserved (CNF=0x03) @def _GPIO_CNF_INPUT_RESERVED */
#define _GPIO_CNF_INPUT_RESERVED						((_gpio_config_t) 0x03)

/**
 * @brief LL Constants for setting the Pull-Up/Pull-Down state in the ODR register.
 * @section GPIO_LL_PinParams_CNF_Input_Macros_PullConfig 
 * @details Use this for LL PULL Staging 
 * @{
 */
/** @brief Sets the ODR bit to '0' for PULL-DOWN activation. @def _GPIO_PULL_PULLDOWN */
#define _GPIO_PULL_PULLDOWN								((_gpio_pin_pull_state_t) 0x00)
/** @brief Sets the ODR bit to '1' for PULL-UP activation. @def _GPIO_PULL_PULLUP */
#define _GPIO_PULL_PULLUP								((_gpio_pin_pull_state_t) 0x01)

/** @} */ // GPIO_LL_PinParams_CNF_Input_Macros_PullConfig

/** @} */ // GPIO_LL_PinParams_CNF_Input_Macros

/**
 * @brief Configuration setting when MODE = Output/AF (0x01, 0x02, 0x03)
 * @section GPIO_LL_PinParams_CNF_Output_Macros 
 * @details Use this for LL Output Configuration 
 * @{
 */
/** @brief Output: General Purpose Push-pull (CNF=0x00) @def _GPIO_CNF_OUTPUT_PP */
#define _GPIO_CNF_OUTPUT_PP								((_gpio_config_t) 0x00)
/** @brief Output: General Purpose Open-drain (CNF=0x01) @def _GPIO_CNF_OUTPUT_OD */
#define _GPIO_CNF_OUTPUT_OD								((_gpio_config_t) 0x01)
/** @brief Output: Alternate Function Push-pull (CNF=0x02) @def _GPIO_CNF_AF_PP */
#define _GPIO_CNF_AF_PP									((_gpio_config_t) 0x02)
/** @brief Output: Alternate Function Open-drain (CNF=0x03) @def _GPIO_CNF_AF_OD */
#define _GPIO_CNF_AF_OD									((_gpio_config_t) 0x03)

/** @} */ // GPIO_LL_PinParams_CNF_Output_Macros

/** @} */ // GPIO_LL_PinParams_Config_Macros

/**
 * @brief Creates a mask for the CNF field (bits 3:2 of the 4-bit block).
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param cnf @ref GPIO_LL_PinParams_Config_Macros "Pin Configuration Value"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_CNF_GET_MASK
 */
#define _GPIO_PIN_CNF_GET_MASK(pin, cnf) \
	((uint32_t)(((uint32_t)(cnf)) << ((((pin) & _GPIO_PIN_7) << 2) + 2)))
/**
 * @brief Creates a reset mask for the CNF field (bits 3:2 of the 4-bit block).
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number" (0-15).
 * @return The final 32-bit mask value (with 2 bits set to '1').
 * @ref _GPIO_PIN_CNF_GET_MASK "GPIO Pin Configuration Mask"
 * @def _GPIO_PIN_CNF_RESET_MASK
 */
#define _GPIO_PIN_CNF_RESET_MASK(pin)							_GPIO_PIN_CNF_GET_MASK(pin, 0x03)	

/** @} */ // GPIO_LL_PinParams_Config

/** @} */ // GPIO_02_LL_03_PinParams

/**
 * @brief GPIO Low Level Lock APIs
 * @defgroup GPIO_02_LL_03_Lock GPIO LL Locking APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief GPIO Lock Status Type
 * @section GPIO_LL_Lock GPIO LL Lock Macros 
 * @details
 * Type-safe abstraction for GPIO lock operation results. Provides clear
 * status reporting for lock configuration operations without using enums.
 * 
 * - **0x00**: Lock operation completed successfully
 * - **0x01**: Lock operation failed (hardware verification failed)
 * - **0x02**: Lock is currently active and enforced
 * - **0x03**: Lock is not active or has been reset
 * 
 * @note Lock status is verified by reading back the LCKR register and
 *       checking the LCKK bit after the locking sequence completes.
 * 
 * @example
 * @code
 * _gpio_lock_status_t status = _GPIO_LockPin(GPIOA, _GPIO_PIN_5);
 * if (status == _GPIO_LOCK_SUCCESS) 
 * {
 *     // Pin successfully locked until next reset
 * }
 * @endcode 
 * 
 */
/** @brief GPIO Lock LL Data Type @typedef _gpio_lock_status_t */
typedef uint8_t _gpio_lock_status_t;
/** @brief Lock operation completed successfully @def _GPIO_LOCK_SUCCESS */
#define _GPIO_LOCK_SUCCESS									((_gpio_lock_status_t) 0x00)
/** @brief Lock operation failed @def _GPIO_LOCK_FAILED */
#define _GPIO_LOCK_FAILED									((_gpio_lock_status_t) 0x01)
/** @brief Lock is currently active @def _GPIO_LOCK_ENABLED */
#define _GPIO_LOCK_ENABLED									((_gpio_lock_status_t) 0x02)
/** @brief Lock is not active @def _GPIO_LOCK_DISABLED */
#define _GPIO_LOCK_DISABLED									((_gpio_lock_status_t) 0x03)

/** @} */ // GPIO_02_LL_03_Lock */

/**
 * @section GPIO_LL_Mode_Stage GPIO Low Level Mode Stage APIs
 * @ingroup GPIO_02_LL_03_PinParams
 * @{
 */

/**
 * @brief Stage GPIO Pin Mode Configuration into input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] mode Value of @ref GPIO_LL_PinParams_Mode_Macros "GPIO Pin Mode"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Mode
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH
 * @note - Register Value to be provided as input
 * @see @ref GPIO_Pins_Mode "GPIO Pin Mode Theory"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageMode(const _gpio_pin_t pin, const _gpio_mode_t mode, uint32_t crxReg)
{
	crxReg &= ~_GPIO_PIN_MODE_RESET_MASK(pin);
	crxReg |= _GPIO_PIN_MODE_GET_MASK(pin, mode);
	return crxReg;
}

/**
 * @brief Stage GPIO Pin Configuration into the input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] config Value of @ref GPIO_LL_PinParams_Config_Macros "GPIO Pin Configuration"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Configuration
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref @ref GPIO_LL_PinParams_Config "GPIO Pin Configuration Theory"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageConfig(const _gpio_pin_t pin, const _gpio_config_t config, uint32_t crxReg)
{
	crxReg &= ~_GPIO_PIN_CNF_RESET_MASK(pin);
	crxReg |= _GPIO_PIN_CNF_GET_MASK(pin, config);
	return crxReg; 
}

/**
 * @brief Stage GPIO Pin Mode and Configuration into the input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] mode Value of @ref GPIO_LL_PinParams_Mode_Macros "GPIO Pin Mode"
 * @param[in] config Value of @ref GPIO_LL_PinParams_Config_Macros "GPIO Pin Configuration"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Mode and Configuration
 * @note - This function simplifies User API configuration by wrapping _GPIO_PinStageMode and _GPIO_PinStageConfig.
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref _GPIO_PinStageMode "GPIO Pin Mode Staging API" | @ref _GPIO_PinStageConfig "GPIO Pin Configuration Staging API"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageParams(const _gpio_pin_t pin, const _gpio_mode_t mode, const _gpio_config_t config, uint32_t crxReg)
{
	return _GPIO_PinStageConfig(pin, config, _GPIO_PinStageMode(pin, mode, crxReg));
}

/**
 * @brief Stages the GPIO Pin to default mode
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @note Sets the Pin to Default (Input Floating) State
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref _GPIO_PinStageParams "GPIO Pin Parameters Staging API"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageResetParams(const _gpio_pin_t pin, uint32_t crxReg)
{
    return _GPIO_PinStageParams(pin, _GPIO_MODE_INPUT, _GPIO_CNF_INPUT_FLOATING, crxReg);
}

/**
 * @brief Stage GPIO Pin Pull-Up/Pull-Down state into the input ODR register value
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] pud_state Value of @ref GPIO_LL_PinParams_CNF_Input_Macros_PullConfig "Pull-Up or Pull-Down"
 * @param[in] odrReg The current staged ODR value
 * @returns The updated staged ODR register value with new PULL state
 * @note - Preferred usage is during batch update for configuration
 * @note - Register Value to be provided as input
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStagePullConfig(const _gpio_pin_t pin, const _gpio_pin_pull_state_t pud_state, uint32_t odrReg)
{
	if(pud_state == _GPIO_PULL_PULLDOWN) odrReg &= ~GPIO_LL_GET_PIN_MASK(pin);
	else if (pud_state == _GPIO_PULL_PULLUP) odrReg |= GPIO_LL_GET_PIN_MASK(pin);
	return odrReg;
}

/** @} */ // GPIO_02_LL_03_PinParams

